{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "ACCIDENT",
    "1": "AEROPLANE",
    "2": "AFRAID",
    "3": "AGREE",
    "4": "ALL",
    "5": "ANGRY",
    "6": "ANYTHING",
    "7": "APPRECIATE",
    "8": "BABY",
    "9": "BAD",
    "10": "BARK",
    "11": "BEAUTIFUL",
    "12": "BECOME",
    "13": "BED",
    "14": "BIG",
    "15": "BITE",
    "16": "BORED",
    "17": "BRING",
    "18": "BUSY",
    "19": "CALCULATOR",
    "20": "CALL",
    "21": "CHAT",
    "22": "CLASS",
    "23": "COLD",
    "24": "COLLEGE",
    "25": "COMB",
    "26": "COME",
    "27": "CONGRATULATIONS",
    "28": "COST",
    "29": "CRYING",
    "30": "DANCE",
    "31": "DARE",
    "32": "DIFFERENCE",
    "33": "DILEMMA",
    "34": "DISAPPOINTED",
    "35": "DO",
    "36": "DOCTOR",
    "37": "DONT_CARE",
    "38": "DRINK",
    "39": "ENJOY",
    "40": "FARM",
    "41": "FARMER",
    "42": "FAVOUR",
    "43": "FEVER",
    "44": "FINE",
    "45": "FOOD",
    "46": "FREE",
    "47": "FRIEND",
    "48": "FROM",
    "49": "GO",
    "50": "GOOD",
    "51": "GRATEFUL",
    "52": "HAD",
    "53": "HAPPENED",
    "54": "HAPPY",
    "55": "HEAR",
    "56": "HEART",
    "57": "HELLO",
    "58": "HELP",
    "59": "HI",
    "60": "HIDING",
    "61": "HOW",
    "62": "HUNGRY",
    "63": "HURT",
    "64": "I_ME_MY_MINE",
    "65": "KIND",
    "66": "LEAVE",
    "67": "LIKE",
    "68": "LOVE",
    "69": "MEDICINE",
    "70": "MEET",
    "71": "NAME",
    "72": "NICE",
    "73": "NOT",
    "74": "NUMBER",
    "75": "OLD_AGE",
    "76": "ON_THE_WAY",
    "77": "OUTSIDE",
    "78": "PHONE",
    "79": "PLACE",
    "80": "PLEASE",
    "81": "POUR",
    "82": "PREPARE",
    "83": "PROMISE",
    "84": "REALLY",
    "85": "REPEAT",
    "86": "ROOM",
    "87": "SCHOOL",
    "88": "SERVE",
    "89": "SHIRT",
    "90": "SIKH",
    "91": "SITTING",
    "92": "SLEEP",
    "93": "SLOWER",
    "94": "SOFTLY",
    "95": "SOMETHING",
    "96": "SOME_HOW",
    "97": "SOME_ONE",
    "98": "SORRY",
    "99": "SO_MUCH",
    "100": "SPEAK",
    "101": "STOCK",
    "102": "STOP",
    "103": "STUBBORN",
    "104": "SURE",
    "105": "TAKE_CARE",
    "106": "TAKE_TIME",
    "107": "TALK",
    "108": "TELL",
    "109": "THANK",
    "110": "THAT",
    "111": "THINGS",
    "112": "THINK",
    "113": "THIRSTY",
    "114": "TIRED",
    "115": "TODAY",
    "116": "TRAIN",
    "117": "TRUST",
    "118": "TRUTH",
    "119": "TURN_ON",
    "120": "UNDERSTAND",
    "121": "WANT",
    "122": "WATER",
    "123": "WEAR",
    "124": "WELCOME",
    "125": "WHAT",
    "126": "WHERE",
    "127": "WHO",
    "128": "WORRY",
    "129": "YOU_YOUR"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ACCIDENT": 0,
    "AEROPLANE": 1,
    "AFRAID": 2,
    "AGREE": 3,
    "ALL": 4,
    "ANGRY": 5,
    "ANYTHING": 6,
    "APPRECIATE": 7,
    "BABY": 8,
    "BAD": 9,
    "BARK": 10,
    "BEAUTIFUL": 11,
    "BECOME": 12,
    "BED": 13,
    "BIG": 14,
    "BITE": 15,
    "BORED": 16,
    "BRING": 17,
    "BUSY": 18,
    "CALCULATOR": 19,
    "CALL": 20,
    "CHAT": 21,
    "CLASS": 22,
    "COLD": 23,
    "COLLEGE": 24,
    "COMB": 25,
    "COME": 26,
    "CONGRATULATIONS": 27,
    "COST": 28,
    "CRYING": 29,
    "DANCE": 30,
    "DARE": 31,
    "DIFFERENCE": 32,
    "DILEMMA": 33,
    "DISAPPOINTED": 34,
    "DO": 35,
    "DOCTOR": 36,
    "DONT_CARE": 37,
    "DRINK": 38,
    "ENJOY": 39,
    "FARM": 40,
    "FARMER": 41,
    "FAVOUR": 42,
    "FEVER": 43,
    "FINE": 44,
    "FOOD": 45,
    "FREE": 46,
    "FRIEND": 47,
    "FROM": 48,
    "GO": 49,
    "GOOD": 50,
    "GRATEFUL": 51,
    "HAD": 52,
    "HAPPENED": 53,
    "HAPPY": 54,
    "HEAR": 55,
    "HEART": 56,
    "HELLO": 57,
    "HELP": 58,
    "HI": 59,
    "HIDING": 60,
    "HOW": 61,
    "HUNGRY": 62,
    "HURT": 63,
    "I_ME_MY_MINE": 64,
    "KIND": 65,
    "LEAVE": 66,
    "LIKE": 67,
    "LOVE": 68,
    "MEDICINE": 69,
    "MEET": 70,
    "NAME": 71,
    "NICE": 72,
    "NOT": 73,
    "NUMBER": 74,
    "OLD_AGE": 75,
    "ON_THE_WAY": 76,
    "OUTSIDE": 77,
    "PHONE": 78,
    "PLACE": 79,
    "PLEASE": 80,
    "POUR": 81,
    "PREPARE": 82,
    "PROMISE": 83,
    "REALLY": 84,
    "REPEAT": 85,
    "ROOM": 86,
    "SCHOOL": 87,
    "SERVE": 88,
    "SHIRT": 89,
    "SIKH": 90,
    "SITTING": 91,
    "SLEEP": 92,
    "SLOWER": 93,
    "SOFTLY": 94,
    "SOMETHING": 95,
    "SOME_HOW": 96,
    "SOME_ONE": 97,
    "SORRY": 98,
    "SO_MUCH": 99,
    "SPEAK": 100,
    "STOCK": 101,
    "STOP": 102,
    "STUBBORN": 103,
    "SURE": 104,
    "TAKE_CARE": 105,
    "TAKE_TIME": 106,
    "TALK": 107,
    "TELL": 108,
    "THANK": 109,
    "THAT": 110,
    "THINGS": 111,
    "THINK": 112,
    "THIRSTY": 113,
    "TIRED": 114,
    "TODAY": 115,
    "TRAIN": 116,
    "TRUST": 117,
    "TRUTH": 118,
    "TURN_ON": 119,
    "UNDERSTAND": 120,
    "WANT": 121,
    "WATER": 122,
    "WEAR": 123,
    "WELCOME": 124,
    "WHAT": 125,
    "WHERE": 126,
    "WHO": 127,
    "WORRY": 128,
    "YOU_YOUR": 129
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.36.2"
}
